doc/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-29 lun. 15:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>README</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Emmanuel GALLOIS" />
<link rel="stylesheet" type="text/css" href="./css/solarized-light.min.css" />

            <link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
            <link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>

</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Description</a></li>
<li><a href="#orgheadline2">Getting started</a></li>
<li><a href="#orgheadline3">Usage</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Description</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
This project is the answer of a challenge I've been asked for a job
position. I decided to answer to it with the Scala language.    
</p>

<p>
See the challenge description in the <b><a href="index.html">documentation</a></b>.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Getting started</h2>
<div class="outline-text-2" id="text-orgheadline2">
<ul class="org-ul">
<li>Make sure you have the following dependencies installed :
<ul class="org-ul">
<li><a href="https://www.java.com/">Java</a>  minimum version <code>7</code> (<code>8</code> recommended).</li>
<li><a href="http://scala-lang.org/">Scala</a>  minimum version <code>2.10.x</code> (<code>2.11.8</code> recommended).</li>
<li><a href="http://www.scala-sbt.org/">sbt</a> version <code>0.13.x</code> (<code>0.13.12</code> recommended).</li>
</ul></li>
<li><p>
Clone this repository to your computer:
</p>
<pre class="example">
git clone https://github.com/undx/challenge.git
</pre></li>
</ul>
<p>
You're ready, go to your cloned repository.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Usage</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
The project relies on simple-build-tool (sbt). The first time you'll run
sbt in the project, all internal dependencies will be fetched.
</p>

<p>
Here are the main targets:
</p>
<dl class="org-dl">
<dt><code>sbt test</code></dt><dd>Run the projects' tests.</dd>
<dt><code>sbt generateDatasets</code></dt><dd>Build some sample datasets that you can use for
running the application. There are five of them in the <code>./data/</code>
folder :
<ul class="org-ul">
<li><code>tiny.csv</code> -&gt; 100 rows.</li>
<li><code>small.csv</code> -&gt; 1000 rows.</li>
<li><code>medium.csv</code> -&gt; 100,000 rows.</li>
<li><code>large.csv</code> -&gt; 1,000,000 rows.</li>
<li><code>huge.csv</code> -&gt; 10,000,000 rows.</li>
</ul></dd>
</dl>

<p>
Other targets :
</p>

<dl class="org-dl">
<dt><code>sbt doc</code></dt><dd>Build Scaladoc of the project.</dd>
<dt><code>sbt oneJar</code></dt><dd><p>
Build a standalone jar containing code and dependencies for running the project with java
in the target folder. To use the standalone jar:
</p>
<div class="org-src-container">

<pre class="src src-sh">$ java -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar --help
</pre>
</div></dd>
</dl>

<p>
For <i>running project</i> inside sbt, first step into a sbt session (<code>sbt</code>), then use the command   
</p>
<dl class="org-dl">
<dt><code>run &lt;params&gt;</code></dt><dd><p>
Launch the executable. There's only one mandatory
   parameter <code>-f &lt;file&gt;</code>, the input source. 
To see the list of parameters and help, just run <code>sbt run --help</code>:
</p>
<pre class="example">
Usage: challenge [options]

  -f, --filename &lt;file&gt;    input filename to process.
  -d, --department &lt;dept&gt;  department selection. You can select only one in HR1, HR2, etc.
  -r, --rooms &lt;r1,r2,...&gt;  rooms to include (A to F).
  -o, --output &lt;path&gt;      where to write files produced. Defaults to filename's folder.
  --help                   prints this usage text
</pre>
<p>
Here's an example:
</p>
<pre class="example">
run -f data/large.csv -d HR7 -r A,C -o /home/me/tmp/challenge
</pre></dd>
</dl>
</div>
</div>
</div>
</body>
</html>
